// 1) Переделать этот код так, чтобы в нем были операторы 
//    инкремента и декремента:
let num = 10;
num++;
num += 1;
num--;
console.log(num);


// 2) Переделайте этот код так, 
// чтобы в нем использовались операторы присвоения:
let number = 47;
number += 7;
number -= 18;
number *= 10;
number /= 15;
alert(number);


// 3) 1)Переделайте приведенный код так, чтобы в нем использовались операции 
//   +=, -=, *=, /=, ++, --. 
//   Количество строк кода при этом не должно измениться. 
//   Код для переделки:
  let count = 1;
  count += 12;
  count -= 14;
  count *= 5;
  count /= 7;
  count++;
  count--;
  alert(count);